---
type: StructuralSectionGeneralT
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 10
tags: [revit-api, class]
---

# StructuralSectionGeneralT

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralT | 2018 | `public StructuralSectionGeneralT ( double width , double height , double flangeThickness , double flangeThicknessLocation , double flangeFillet , double flangeToeOfFillet , double slopedFlangeAngle , double webThickness ` |
| Method | GetFlangeThicknessInFlangeCenter | 2018 | `public double GetFlangeThicknessInFlangeCenter ()` |
| Method | GetFlangeThicknessInQuarterWidth | 2018 | `public double GetFlangeThicknessInQuarterWidth ()` |
| Method | GetWebThicknessInHeightCenter | 2018 | `public double GetWebThicknessInHeightCenter ()` |
| Property | FlangeFillet | 2018 | `public double FlangeFillet { get ; set ; }` |
| Property | FlangeToeOfFillet | 2018 | `public double FlangeToeOfFillet { get ; set ; }` |
| Property | SlopedFlangeAngle | 2018 | `public double SlopedFlangeAngle { get ; set ; }` |
| Property | SlopedWebAngle | 2018 | `public double SlopedWebAngle { get ; set ; }` |
| Property | TopWebFillet | 2018 | `public double TopWebFillet { get ; set ; }` |
| Property | WebToeOfFillet | 2018 | `public double WebToeOfFillet { get ; set ; }` |